БИТУправление_медицинским_центром_демо/src/DataProcessors/РедактированиеКонтактнойИнформации/РедактированиеКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РедактированиеКонтактнойИнформации</name>
  <comment>Служит для редактирования контактной информации</comment>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <comment>Тип</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <comment>Вид</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <comment>Представление</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поле1</name>
    <comment>Поле 1 </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле2</name>
    <comment>Поле 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле3</name>
    <comment>Поле 3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле4</name>
    <comment>Поле 4</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле5</name>
    <comment>Поле 5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле6</name>
    <comment>Поле 6</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле7</name>
    <comment>Поле 7</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле8</name>
    <comment>Поле 8</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле9</name>
    <comment>Поле 9</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьВРегистр</name>
    <comment>Записывать в регистр</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поле10</name>
    <comment>Поле 10</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле11</name>
    <comment>Поле 11</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле12</name>
    <comment>Поле 12</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьОбъекта</name>
    <comment>Доступность объекта</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородскойРайон</name>
    <comment>Городской район проживания</comment>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставление</name>
    <comment>Краткое представление</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКорпуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <comment>Признак значения по умолчанию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Произвольный комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <comment>Вспомогательное поле: &quot;Код страны&quot; или &quot;Индекс&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <comment>Вспомогательное поле: &quot;Код города&quot; или &quot;Регион&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <comment>Вспомогательное поле: &quot;Номер телефона&quot; или &quot;Район&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <comment>Вспомогательное поле: &quot;Внутренний (или добавочный)  номер&quot; или &quot;Город&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <comment>Вспомогательное поле: &quot;Населенный пункт&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <comment>Вспомогательное поле: &quot;Улица&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <comment>Вспомогательное поле: &quot;Дом&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <comment>Вспомогательное поле: &quot;Корпус&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <comment>Вспомогательное поле: &quot;Квартира&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <comment>Строковое представление контактной информации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <comment>Вспомогательное поле: &quot;Подъезд&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле11</name>
    <comment>Вспомогательное поле: &quot;Этаж&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле12</name>
    <comment>Вспомогательное поле: &quot;Код двери/домофон&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГородскойРайон</name>
    <comment>Городской район проживания</comment>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>КраткоеПредставление</name>
    <comment>Краткое представление</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект-владелец контактной информации</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <comment>Вид контактной информации</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/DataProcessors/РедактированиеКонтактнойИнформации/Forms/ФормаЗаписиАдресаЭПУпр/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначенияЗаполнения") 
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")
	Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект, Параметры.ЗначенияЗаполнения);
		Параметры.ЗначенияЗаполнения.Свойство("Редактирование", ЭтаФорма.Редактирование);
	КонецЕсли;	
	
	Если Редактирование Тогда
		ПоляКлючаЗаписи = Новый Структура("Объект, Тип, Вид", Объект.Объект, Объект.Тип, Объект.Вид);
		КлючЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьКлючЗаписи(ПоляКлючаЗаписи);
	КонецЕсли;
	
	Объект.Тип = Объект.Вид.Тип;
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ?(Объект.Объект = Неопределено,""," ["+Объект.Объект.Наименование+"]");

	СписокВидов = КонтактнаяИнформацияСервер.ЗаполнитьСписокВидовКонтактнойИнформации(Объект.Вид);
	Для Каждого Стр Из СписокВидов Цикл
    	Элементы.Вид.СписокВыбора.Добавить(Стр.Значение);
	КонецЦикла;	
	
	Попытка 
		Элементы.НадписьВладелец.Заголовок = Объект.Объект["НаименованиеПолное"];
	Исключение
		Попытка
			Элементы.НадписьВладелец.Заголовок = Объект.Наименование;
		Исключение
		КонецПопытки;
	КонецПопытки;
	
	// Заполнение полей частей адреса из сохраненного представления
	Если Параметры.Свойство("ЗначенияЗаполнения") 
		И Параметры.ЗначенияЗаполнения.Свойство("Представление")
	Тогда
		ПолныйАдрес = Параметры.ЗначенияЗаполнения.Представление;
		
		ЧастиАдреса = СтрЗаменить(ПолныйАдрес, "@", Символы.ПС);
		ТелоПочты = СтрПолучитьСтроку(ЧастиАдреса, 1);
		ЧастиАдреса = СтрЗаменить(СтрПолучитьСтроку(ЧастиАдреса,2),".",Символы.ПС);
		Домен = СтрПолучитьСтроку(ЧастиАдреса, 1);
		ДоменПослеТочки = СтрПолучитьСтроку(ЧастиАдреса, 2);
	КонецЕсли;	
	
	// Стандартные домены
	Элементы.Домен.СписокВыбора.ЗагрузитьЗначения(КонтактнаяИнформацияСерверПереопределяемый.СтандартныеДоменыПочты());
	
	Если ЗначениеЗаполнено(Объект.Вид) Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.ТелоПочты;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОсновныеДействияФормыДействиеОК(Команда)
	
	ЗаписатьЭП(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыДействиеЗаписать(Команда)
	
	ЗаписатьЭП();

КонецПроцедуры

&НаКлиенте
Процедура вEN(Команда)
	
	ТелоПочты		 = КонвертироватьРаскладкуРусАнг(ТелоПочты);
	Домен			 = КонвертироватьРаскладкуРусАнг(Домен);
	ДоменПослеТочки	 = КонвертироватьРаскладкуРусАнг(ДоменПослеТочки);
	
КонецПроцедуры

&НаКлиенте
Процедура вRUS(Команда)
	
	ТелоПочты		 = КонвертироватьРаскладкуРусАнг(ТелоПочты, Ложь);
	Домен			 = КонвертироватьРаскладкуРусАнг(Домен, Ложь);
	ДоменПослеТочки	 = КонвертироватьРаскладкуРусАнг(ДоменПослеТочки, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаписатьЭП(Закрыть = Ложь)
	
	Объект.Представление = ТелоПочты + "@" + Домен + "." + ДоменПослеТочки;
	
	Если Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Объект.Представление) Тогда
		Ответ = Вопрос(НСтр("ru = 'Почтовый адрес заполнен неверно. Продолжить запись?'"), РежимДиалогаВопрос.ОКОтмена, 30, КодВозвратаДиалога.Отмена);
		Если Ответ <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаписатьСервер() Тогда
		Модифицированность = Ложь;
		Если Закрыть Тогда
			Закрыть(Истина);
		КонецЕсли;	
		// Оповещение динамических списков контактной информации без основной таблицы об изменении данных.
		Оповестить("КонтактнаяИнформацияИзменение", Объект.Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьСервер()
	
	Об = ДанныеФормыВЗначение(Объект, ТИп("ОбработкаОбъект.РедактированиеКонтактнойИнформации"));
	Возврат Об.ЗаписатьСервер(Объект.ЗначениеПоУмолчанию, Редактирование, КлючЗаписи);
	
КонецФункции	

&НаКлиенте
Процедура ДоменОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ЧастиСтроки = СтрРазделить(ВыбранноеЗначение, ".", Ложь);
		
		ПоследнийИндекс = ЧастиСтроки.Количество() - 1;
		ДоменПослеТочки = ЧастиСтроки[ПоследнийИндекс];
		
		ЧастиСтроки.Удалить(ПоследнийИндекс);
		Домен = СтрСоединить(ЧастиСтроки, ".");
		
		ПолныйАдрес = ТелоПочты + "@" + Домен + "." + ДоменПослеТочки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КонвертироватьРаскладкуРусАнг(Текст, в_EN = Истина)
	
	Рус = "ё йцукенгшщзхъ фывапролджэ ячсмитьбю Ё ЙЦУКЕНГШЩЗХЪ ФЫВАПРОЛДЖЭ ЯЧСМИТЬБЮ";
	Анг = "` qwertyuiop[] asdfghjkl;' zxcvbnm,. ~ QWERTYUIOP{} ASDFGHJKL:"+Символ(34)+" ZXCVBNM<>";
	
	Если в_EN Тогда
		ИсходныйСловарь	= Рус;
		ЦелевойСловарь	= Анг;
	Иначе
		ИсходныйСловарь	= Анг;
		ЦелевойСловарь	= Рус;
	КонецЕсли;
	
	ТекстИтог = "";
	
	Для Сч = 1 По СтрДлина(Текст) Цикл
		
		Символ = Сред(Текст, Сч, 1);
		
		ИндСловаря = СтрНайти(ИсходныйСловарь, Символ);
		Если ИндСловаря = 0 Тогда
			ТекстИтог = ТекстИтог + Символ;
		Иначе
			НовыйСимвол = Сред(ЦелевойСловарь, ИндСловаря, 1);
			ТекстИтог = ТекстИтог + НовыйСимвол;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекстИтог;
	
КонецФункции

&НаКлиенте
Процедура ТелоПочтыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание <> 0 Тогда
		Инд = СтрНайти(Текст, "@");
		Если Инд > 0 Тогда
			АдресаПочты = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Текст);
			АдресПочты = Неопределено;
			Для Каждого СтруктураАдреса Из АдресаПочты Цикл
				Если ПустаяСтрока(СтруктураАдреса.ОписаниеОшибки) Тогда
					АдресПочты = СтруктураАдреса.Адрес;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(АдресПочты) Тогда
				Инд = СтрНайти(АдресПочты, "@");
				
				ТелоПочты = Лев(АдресПочты, Инд - 1);
				
				ДоменПолный = Прав(АдресПочты, СтрДлина(АдресПочты) - Инд);
				
				ЧастиДомена = СтрРазделить(ДоменПолный, ".", Истина);
				
				Домен = "";
				ДоменПослеТочки = "";
				Если ЧастиДомена.Количество() = 1 Тогда
					Домен = ДоменПолный;
				ИначеЕсли ЧастиДомена.Количество() > 1 Тогда
					ДоменПослеТочки = ЧастиДомена[ЧастиДомена.Количество() - 1];
					ЧастиДомена.Удалить(ЧастиДомена.Количество() - 1);
					Домен = СтрСоединить(ЧастиДомена, ".");
				КонецЕсли;
				
				ПолныйАдрес = ТелоПочты + "@" + Домен + "." + ДоменПослеТочки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПочтыПриИзменении(Элемент)
	
	ПолныйАдрес = ТелоПочты + "@" + Домен + "." + ДоменПослеТочки;
	
КонецПроцедуры

#КонецОбласти
